#------------------------------------------------------------------------------------------------------------------------------------
# 5.15
# Напишите программу, выводящую на печать количество слов в строке. Слова разделяются одним или несколькими пробелами.
str = "   Что   бы   это   ни   значило   "
print("5.15: ", len(str.split()))