#------------------------------------------------------------------------------------------------------------------------------------
# 5.3
# Напишите программу, которая будет проверять, что строка оканчивается на нижнее
# подчёркивание. Если условие выполняется, то программа должна написать True, если
# нет, то False. Также программа должна написать False, если строка нулевой длины.
str = "Hello_"
print("5.3: ", str.endswith("_"))