#------------------------------------------------------------------------------------------------------------------------------------
# 5.4
# Одноклассникам стало интересно, сколько раз Петя произнесёт слово «типа» во время ответа у доски.
# Они записали стенограмму Петиного выступления. Напишите программу, которая будет выводить, сколько
# раз в строке встречается слово «типа».
line = "ну типа так типа я зыбыл типа"
print("5.4: ", line.count("типа"))