#------------------------------------------------------------------------------------------------------------------------------------
# 7.7
# Напишите команду, которая выводит в консоль число 5.724609312 с точностью до трёх знаков после точки. Что получилось?
print("7.7: ", f"{5.724609312:.3f}")